# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(s1, s2, s3)

0     2
1     2
2     1
3     3
4     4
     ..
95    3
96    2
97    3
98    1
99    3
Length: 100, dtype: int32 0     2
1     1
2     1
3     3
4     1
     ..
95    2
96    1
97    1
98    1
99    3
Length: 100, dtype: int32 0     18802
1     27556
2     27769
3     18709
4     22394
      ...
95    15437
96    10277
97    20253
98    10012
99    10069
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [4]:
df = pd.concat([s1, s2, s3], axis=1)
df.head()

   0  1      2
0  2  2  18802
1  2  1  27556
2  1  1  27769
3  3  3  18709
4  4  1  22394

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [5]:
df.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      2       2            18802
1      2       1            27556
2      1       1            27769
3      3       3            18709
4      4       1            22394

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [7]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       2
2       1
3       3
4       4
..    ...
95  15437
96  10277
97  20253
98  10012
99  10069

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [8]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [9]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        2
2        1
3        3
4        4
..     ...
295  15437
296  10277
297  20253
298  10012
299  10069

[300 rows x 1 columns]